In [1]:
print("BRO did it work?")

BRO did it work?

Below is a test given by the instructor - used to verify that the notebook works and is functional.

In [2]:
# Import the necessary library
import pandas as pd

# Create two sample DataFrames
data1 = {'Name': ['Alice', 'Bob'], 'Age': [25, 30]}
df1 = pd.DataFrame(data1)

data2 = {'Name': ['Alice', 'Charlie'], 'City': ['New York', 'London']}
df2 = pd.DataFrame(data2)

# Merge the DataFrames on the 'Name' column
merged_df = pd.merge(df1, df2, on='Name', how='outer')

# Display the merged DataFrame
merged_df

      Name   Age      City
0    Alice  25.0  New York
1      Bob  30.0       NaN
2  Charlie   NaN    London